IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        77 X PIC 99.
        77 Y PIC 99.
        77 Z PIC 99.
PROCEDURE DIVISION.

    SET X TO 10.
    SET Y TO 25.
    ADD X Y GIVING Z.
    DISPLAY "X + Y = "Z.
    
    SET X TO 10.
    SET Y TO 25.
    SUBTRACT X FROM Y GIVING Z.
    DISPLAY "X - Y = "Z.
    
    SET X TO 10.
    SET Y TO 25.
    MULTIPLY X BY Y GIVING Z.
    DISPLAY "X * Y = "Z.
    
    SET X TO 10.
    SET Y TO 20.
    DIVIDE X BY Y GIVING Z.
    DISPLAY "X / Y = "Z.
STOP RUN.
